       IDENTIFICATION DIVISION.
           PROGRAM-ID. ALOMUNDO.
       ENVIRONMENT DIVISION.
           DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "Alo, Mundo!!".
           STOP RUN.